---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShapeDefinition.IsPlanar
source: html/a401ad32-ed12-66d3-2f50-09039d112c25.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeDefinition.IsPlanar Property

Reports whether the shape definition lies within a plane: false if a spiral,
 true in all other cases.

## Syntax (C#)
```csharp
public bool IsPlanar { get; }
```